src/cf/InformationRegisters/GDS_ДанныеАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДанныеАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ДокументыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ДокументыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.GDS_АктПриемаПередачиТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ФайлыАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ФайлыАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_ОчередьСообщенийАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_ОчередьСообщенийАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщенияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/GDS_НастройкиПодключенияАПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_НастройкиПодключенияАПП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_МетодыАутентификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыгружаемыхДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЛичногоКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИНН_Организации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/GDS_МетодыАутентификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_МетодыАутентификации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Basic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OAuth2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/GDS_АктПриемаПередачиТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_АктПриемаПередачиТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.GDS_ЭлементыПроверки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОсмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсмотрПровел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одометр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Замечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеКСостояниюПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платон</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдометрПрицепТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокТопливаПрицеп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматированноеОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПринял</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПрицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементПроверки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_ПунктыПроверкиТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_СостоянияПроверкиАПП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеПроблем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Замечания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/GDS_АПП/Ext/Module.bsl
#Область РаботаРегламентныхЗаданий

Процедура GDS_ЗагрузкаДанныхИзСервисаАПП() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.GDS_ЗагрузкаДанныхИзСервисаАПП);
	
	НастройкиОбмена = НастройкиПодключения(Перечисления.GDS_МетодыАутентификации.OAuth2);
	
	Для каждого НастройкаКабинета из НастройкиОбмена цикл
		
		ИНН = СокрЛП(НастройкаКабинета.ИНН_Организации);
		
		GDS_КоннекторАПП.ОбработатьСообщения(ИНН);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура GDS_СозданиеАктовПриемаПередачи() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.GDS_СозданиеАктовПриемаПередачи);
	
	#Область АвторизацияДокументооборот
	
	Настройки = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ИспользоватьИнтеграцию();
	
	Если Не Настройки.ИспользоватьИнтеграциюДО2 И Не Настройки.ИспользоватьИнтеграциюДО3 Тогда
		УзелДокументооборота = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.УзелДокументооборота();
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелДокументооборота);
		Возврат;
	КонецЕсли;
	
	// Прочтем настройки авторизации и установим их в параметры сеанса. Константы могут быть недоступны.
	УстановитьПривилегированныйРежим(Истина);
	ИмяПользователя = Константы.ИнтеграцияС1СДокументооборотИмяПользователяДляОбмена.Получить();
	Пароль = Константы.ИнтеграцияС1СДокументооборотПарольДляОбмена.Получить();
	Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда // Прочтем настройки из пользовательского хранилища.
		
		ПарольСохранен = Ложь;
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ПрочитатьНастройкиАвторизацииИзХранилищаОбщихНастроек(
		ИмяПользователя,
		Пароль,
		ПарольСохранен);
		
		Если Не ЗначениеЗаполнено(ИмяПользователя) Тогда
			
			ЗаписьЖурналаРегистрации(
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			НСтр("ru = 'Для пользователя регламентного задания обмена не указано имя пользователя 1С:Документооборота'",
			ОбщегоНазначения.КодОсновногоЯзыка()));
			
			Возврат;
			
		КонецЕсли;
		
		Если ПарольСохранен <> Истина Тогда
			
			ЗаписьЖурналаРегистрации(
			ИнтеграцияС1СДокументооборотБазоваяФункциональность.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,,,
			НСтр("ru = 'Для пользователя регламентного задания обмена не сохранен пароль 1С:Документооборота'",
			ОбщегоНазначения.КодОсновногоЯзыка()));
			
			Возврат;
			
		КонецЕсли;
		
		// Перенесем настройки в константы.
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СохранитьНастройкиАвторизацииДляОбмена(
		ИмяПользователя,
		Пароль);
		ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УдалитьНастройкиАвторизацииИзХранилищаОбщихНастроек();
		
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьНастройкиАвторизацииВПараметрыСеанса(
	ИмяПользователя,
	Пароль,
	Ложь,
	Ложь);
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.УстановитьВерсиюСервисаВПараметрыСеанса();
	
	Прокси = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ПолучитьПрокси();
	Если Прокси = Неопределено Тогда
		// Сервис не доступен.
		Возврат;
	КонецЕсли;
	
	Если Настройки.ИспользоватьИнтеграциюДО2 Тогда
		
		// Проверим поддержку синхронизации.
		Если Не ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("1.3.2.3.CORP") Тогда
			Если ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.ДоступенФункционалВерсииСервиса("") Тогда
				// Сервис доступен, но версия младше требуемой.
				УзелДокументооборота = ИнтеграцияС1СДокументооборотБазоваяФункциональностьПовтИсп.УзелДокументооборота();
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелДокументооборота);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
		МодульИнтеграцияС1СДокументооборотОбмен = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборотОбмен");
		
	ИначеЕсли Настройки.ИспользоватьИнтеграциюДО3 Тогда
		
		МодульИнтеграцияС1СДокументооборот3Обмен = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияС1СДокументооборот3Обмен");
		
	КонецЕсли;
	
	#КонецОбласти
	
	ПодготовитьДанныеДляОтправки();
	ОтправитьДанные();
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляОтправки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	GDS_ДанныеАПП.Идентификатор КАК Идентификатор,
	|	GDS_ДанныеАПП.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.GDS_ДанныеАПП КАК GDS_ДанныеАПП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_ДокументыАПП КАК GDS_ДокументыАПП
	|		ПО GDS_ДанныеАПП.Идентификатор = GDS_ДокументыАПП.Идентификатор
	|ГДЕ
	|	GDS_ДокументыАПП.Документ ЕСТЬ NULL";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторСообщения = Выборка.Идентификатор;
		
		Попытка
			ДанныеАПП = Выборка.Данные.Получить();
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
			
			Подразделение = Справочники.ПодразделенияОрганизаций.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАПП.Подразделение.Ид));
			ДанныеЗаполнения.Вставить("Подразделение", Подразделение);
			
			ПУ = Справочники.уатКолонны.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАПП.ПУ.Ид));
			ДанныеЗаполнения.Вставить("ПУ", ПУ);
			ДанныеЗаполнения.Вставить("ДатаОсмотра", ДанныеАПП.ДатаОсмотра);//дата и время
			
			ТС = Справочники.уатТС.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеАПП.ТС.Ид));
			ДанныеЗаполнения.Вставить("ТС", ТС);
			
			ДанныеЗаполнения.Вставить("Одометр", ДанныеАПП.ТС.МотоЧасыФакт);//одометр
			ДанныеЗаполнения.Вставить("ОдометрТО", ДанныеАПП.ТС.МотоЧасыТО);
			ДанныеЗаполнения.Вставить("ОстатокТоплива", ДанныеАПП.ТС.ОстатокТоплива);
			ДанныеЗаполнения.Вставить("Платон", ДанныеАПП.ТС.ПлатонНомер);
			ДанныеЗаполнения.Вставить("Пробег", ДанныеАПП.ТС.Пробег);
			ДанныеЗаполнения.Вставить("Замечания", ДанныеАПП.ТС.Комментарий);
			
			ДанныеЗаполнения.Вставить("Прицеп");
			ДанныеЗаполнения.Вставить("СтрокаПрицеп", ДанныеАПП.ПрицепОборудование.ГосНомер);
			ДанныеЗаполнения.Вставить("ОдометрПрицеп", ДанныеАПП.ПрицепОборудование.МотоЧасыФакт);
			ДанныеЗаполнения.Вставить("ОдометрПрицепТО", ДанныеАПП.ПрицепОборудование.МотоЧасыТО);
			ДанныеЗаполнения.Вставить("ПробегПрицеп", ДанныеАПП.ПрицепОборудование.Пробег);
			ДанныеЗаполнения.Вставить("ОстатокТопливаПрицеп", ДанныеАПП.ПрицепОборудование.ОстатокТоплива);
			ДанныеЗаполнения.Вставить("ПримечаниеКСостояниюПрицепа", ДанныеАПП.ПрицепОборудование.Комментарий);
			
			ДанныеЗаполнения.Вставить("Сдал");
			ДанныеЗаполнения.Вставить("Принял");
			ДанныеЗаполнения.Вставить("ОсмотрПровел");
			ДанныеЗаполнения.Вставить("СтрокаПринял", ДанныеАПП.Принял);
			
			Логин = ИмяСлужебногоПользователяАктыПриемаПередачи();
			СлужебныйПользователь = Пользователи.НайтиПоИмени(Логин);
			
			ДанныеЗаполнения.Вставить("Ответственный", СлужебныйПользователь);
			ДанныеЗаполнения.Вставить("Комментарий");
			
			//тч проверки - ответы
			ДанныеЗаполнения.Вставить("ЭлементыПроверки", ДанныеАПП.ЭлементыПроверки);
			
			ДокументАПП = Документы.GDS_АктПриемаПередачиТС.СоздатьДокумент();
			ДокументАПП.Заполнить(ДанныеЗаполнения);
			ДокументАПП.Записать(РежимЗаписиДокумента.Запись);
			
			МенеджерЗаписи = РегистрыСведений.GDS_ДокументыАПП.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Идентификатор = ИдентификаторСообщения;
			МенеджерЗаписи.Документ = ДокументАПП.Ссылка;
			
			МенеджерЗаписи.Записать();
			
			//++Временно
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	GDS_ФайлыАПП.Идентификатор КАК Идентификатор,
			|	GDS_ФайлыАПП.ИдентификаторФайла КАК ИдентификаторФайла,
			|	GDS_ФайлыАПП.ДатаФайла КАК ДатаФайла,
			|	GDS_ФайлыАПП.Имя КАК Имя,
			|	GDS_ФайлыАПП.Размер КАК Размер,
			|	GDS_ФайлыАПП.Расширение КАК Расширение,
			|	GDS_ФайлыАПП.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
			|ИЗ
			|	РегистрСведений.GDS_ФайлыАПП КАК GDS_ФайлыАПП
			|ГДЕ
			|	GDS_ФайлыАПП.Идентификатор = &Идентификатор";
			
			Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСообщения);
			
			ПрисоединенныеФайлы = Запрос.Выполнить().Выгрузить();
			
			//ЗАПУСТИТЬ НА СОГЛАСОВАНИЕ В ДОКУМЕНТООБОРООТ
			ОтправитьДанныеВДокументооборот(ДокументАПП.Ссылка, ПрисоединенныеФайлы);
			
		Исключение
			
			ТекстСообщенияОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				ИмяСобытияЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.GDS_ДанныеАПП,
				Строка(ИдентификаторСообщения),
				ТекстСообщенияОбОшибке);
			
			МенеджерЗаписи = РегистрыСведений.GDS_ОчередьСообщенийАПП.СоздатьМенеджерЗаписи();
			//МенеджерЗаписи.ИнтегрированнаяСистема = Выборка.ИнтегрированнаяСистема;
			МенеджерЗаписи.МоментВремени = ТекущаяУниверсальнаяДатаВМиллисекундах();
			МенеджерЗаписи.Идентификатор = ИдентификаторСообщения;
			МенеджерЗаписи.Данные        = Выборка.Данные;
			МенеджерЗаписи.Прочитать();
			//МенеджерЗаписи.КоличествоПопытокОтправки = МенеджерЗаписи.КоличествоПопытокОтправки + 1;
			МенеджерЗаписи.ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке;
			МенеджерЗаписи.Записать();
			
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьДанные()
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	GDS_ФайлыАПП.Идентификатор КАК Идентификатор,
	//|	GDS_ФайлыАПП.ИдентификаторФайла КАК ИдентификаторФайла,
	//|	GDS_ФайлыАПП.ДатаФайла КАК ДатаФайла,
	//|	GDS_ФайлыАПП.Имя КАК Имя,
	//|	GDS_ФайлыАПП.Размер КАК Размер,
	//|	GDS_ФайлыАПП.Расширение КАК Расширение,
	//|	GDS_ФайлыАПП.ДвоичныеДанныеФайла КАК ДвоичныеДанныеФайла
	//|ИЗ
	//|	РегистрСведений.GDS_ФайлыАПП КАК GDS_ФайлыАПП
	//|ГДЕ
	//|	GDS_ФайлыАПП.Идентификатор = &Идентификатор";
	//
	//Запрос.УстановитьПараметр("Идентификатор", ВыборкаДетальныеЗаписи.Идентификатор);
	//
	//ПрисоединенныеФайлы = Запрос.Выполнить().Выгрузить();
	//
	////ЗАПУСТИТЬ НА СОГЛАСОВАНИЕ В ДОКУМЕНТООБОРООТ
	//ОтправитьДанныеВДокументооборот(ДокументАПП.Ссылка, ПрисоединенныеФайлы);
	
КонецПроцедуры

#КонецОбласти

Функция ИмяСлужебногоПользователяАктыПриемаПередачи()
	
	Возврат "WebServices";
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Подготовка данных акта-приема передачи'",
		ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Процедура ОтправитьДанныеВДокументооборот(ПриложениеСсылка, ПрисоединенныеФайлы)
	
	Попытка
		
		Правила = ИнтеграцияС1СДокументооборот3ВызовСервера.ПодходящиеПравилаИнтеграцииОбъекта(ПриложениеСсылка); 
		Правило = Правила[0];
		
		РезультатСоздать = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.ДанныеОбъектаДОПоВнешнемуОбъекту(ПриложениеСсылка);
		
		Если РезультатСоздать = Неопределено Тогда
			РезультатСоздать = ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьОбъектДОПоПравилу(ПриложениеСсылка, Правило);
		КонецЕсли;
		
		РольФайла = "a9bf92f1-4fd8-11ef-b84c-00155d002503";//Дополнительный УИН из Документооборота
		
		Если ПрисоединенныеФайлы.Количество() > 0 Тогда
			Для каждого Стр Из ПрисоединенныеФайлы Цикл
				Наименование       = Стр.Имя;
				Расширение         = Стр.Расширение;

				ДвоичныеДанныеФайла = Стр.ДвоичныеДанныеФайла.Получить();//РаботаСФайлами.ДвоичныеДанныеФайла(ПрисоединенныйФайл);
				
				АдресДвоичныеДанныеФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла);
				
				СтруктураДанныхФайла = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.ДанныеФайла(Наименование, РезультатСоздать.id, РезультатСоздать.type, Расширение, РольФайла);
				СтруктураДанныхФайла.Размер = ДвоичныеДанныеФайла.Размер();

				ПараметрыСоздания = ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиентСервер.НовыеПараметрыСозданияФайла(СтруктураДанныхФайла);
				ПараметрыСоздания.АдресВременногоХранилищаФайла = АдресДвоичныеДанныеФайла;
				
				ИнтеграцияС1СДокументооборотБазоваяФункциональностьВызовСервера.СоздатьФайлВДокументообороте(ПараметрыСоздания,РезультатСоздать.id,РезультатСоздать.type,РезультатСоздать.name);
			КонецЦикла;
			
		КонецЕсли;
		
		ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПроверитьОбновитьДанныеСвязанныхОбъектов();
		
		ТекстОшибки = "";
		
		РезультатЗапуска = ИнтеграцияС1СДокументооборот3ВызовСервера.НачатьОбработку(РезультатСоздать,ТекстОшибки);
		
	Исключение
		РезультатЗапускаПроцесса = Ложь;
	КонецПопытки;
	
КонецПроцедуры

Функция НастройкиПодключения(МетодАутентификации)
	
	Запрос = Новый Запрос; 
	
	Запрос.УстановитьПараметр("МетодАутентификации", МетодАутентификации);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_НастройкиПодключенияАПП.ИНН_Организации КАК ИНН_Организации,
	|	GDS_НастройкиПодключенияАПП.МетодАутентификации КАК МетодАутентификации
	|ИЗ
	|	РегистрСведений.GDS_НастройкиПодключенияАПП КАК GDS_НастройкиПодключенияАПП
	|ГДЕ
	|	GDS_НастройкиПодключенияАПП.МетодАутентификации = &МетодАутентификации
	|
	|СГРУППИРОВАТЬ ПО
	|	GDS_НастройкиПодключенияАПП.ИНН_Организации,
	|	GDS_НастройкиПодключенияАПП.МетодАутентификации"; 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура GDS_СоздатьЗадачиПоЧекЛистам() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.GDS_СоздатьЗадачиПоЧекЛистам);
		
	ТЧ_Обработки = ПолучитьДанныеДляОбработки();
	
	Для Каждого СтрОбработки Из ТЧ_Обработки Цикл
		
		ДанныеЧекЛиста = СтрОбработки.ДанныеТС.Получить();
		
		ФайлыЧекЛистов = СтрОбработки.ДопДанные.Получить();
		
		СписокФайлов = Новый Массив;
	//	Если ФайлыЧекЛистов.Количество()>1 Тогда
			Для Каждого СтрФайл Из ФайлыЧекЛистов Цикл
				
				НазваниеФайла = СтрФайл.Получить("filename");
				НазваниеПроблемы = СтрФайл.Получить("hiddenFieldId");
				ДД_Файла = СтрФайл.Получить("DD_Files");
				
				Адрес = ПоместитьВоВременноеХранилище(ДД_Файла);
				
				ДобавитьФайлДляПрсоединения(СписокФайлов, НазваниеФайла, НазваниеПроблемы, Адрес, Справочники.РолиФайлов.НайтиПоНаименованию("Дополнительные"));
				
			КонецЦикла;
			
		ТабличныйДокумент = ПодготовитьПечатнуюФормуЧекЛиста(СтрОбработки.УИНСообщения);
		
		ИмяФайла = "ЧекЛист";
		
		ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
		
		СоздатьКаталог(ИмяВременнойПапки);
		
		ИмяФайлаСРасширением = ИмяФайла + ".pdf";
		
		ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки) + ИмяФайлаСРасширением;
		
		ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.PDF_A_1);

		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
		
		ДобавитьФайлДляПрсоединения(СписокФайлов, ИмяФайлаСРасширением, ИмяФайла, ПутьВоВременномХранилище, Справочники.РолиФайлов.НайтиПоНаименованию("Основной"));
		
		УдалитьФайлы(ИмяВременнойПапки);
		
	//	КонецЕсли;
	
	ДанныеПроблем = ПодготовитьДанныеОПроблемах(СтрОбработки.УИНСообщения);
	
	СоздатьДокументПоЧекЛисту(СтрОбработки, СписокФайлов, ДанныеПроблем);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьДокументПоЧекЛисту(ДанныеЧекЛиста, МассивФайлов, Описание)
	
	НачатьТранзакцию();
	
	Попытка
		СсылкаНаВД = СоздатьДокументПредприятия(ДанныеЧекЛиста,Описание);
		
		Для Каждого ПрисоединяемыйФайл Из МассивФайлов Цикл
			
			ПрикрепитьФайл(
				СсылкаНаВД,  
				ПрисоединяемыйФайл.АдресХранилищаФайла, 
				ПрисоединяемыйФайл.НазваниеФайла, 
				ПрисоединяемыйФайл.Расширение, 
				ПрисоединяемыйФайл.Размер,
				ПрисоединяемыйФайл.РольФайла);
		КонецЦикла;
		
		ФорматированныйДокумент = GDS_РаботаСФормитированнымОписаниемСервер.ПолучитьФормитированнуюСтроку(ДанныеЧекЛиста.УИНСообщения);
		
	//	СоздатьЗадачиПоКаждойНеисправности(СсылкаНаВД, ФорматированныйДокумент);
		
	//	СоздатьЗадачиПоОзнакомлениюНеисправности(СсылкаНаВД, ФорматированныйДокумент);
		
		//ОбработкаЗапросовXDTOБизнесПроцессыИЗадачи.НачатьОбработку();
		
		//запустить на согласование процесс
	//	ПравилаОбработкиСервер.ЗаполнитьДействияПрограммно(СсылкаНаВД, Справочники.Сотрудники.НайтиПоНаименованию("WebServices"));
	//	ОбработкиОбъектовВызовСервера.НачатьОбработку(СсылкаНаВД);
		ЗаписатьДокументЧекЛиста(СсылкаНаВД, ДанныеЧекЛиста);
		
		//ОтменитьТранзакцию();
		ЗафиксироватьТранзакцию();
		
		//Запись GDS_ДокументыЧекЛиста
	Исключение
	
		ОтменитьТранзакцию();
		
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьЗадачиПоКаждойНеисправности(Предмет, ФорматированныйДокумент)
	
//	//Сообщение = ДанныеЧекЛиста.Сообщение;
//	
//	МассивДляИсполнения = ПолучитьСписокДляИсполнения();
//	
//	//	Для каждого СтрОтветственный Из ТЧ_Проблем Цикл
//		ЗадачаОбъект = Документы.Задача.СоздатьДокумент();
//		
//		Заголовок = СтрШаблон("%1", "Задачи на исполнение");
//		
//		ПараметрыЗаполнения = Новый Структура;
//		ПараметрыЗаполнения.Вставить("ВидЗадачи", Справочники.ВидыЗадач.Поручение);
//		ПараметрыЗаполнения.Вставить("Основание", Предмет);
//		ПараметрыЗаполнения.Вставить("Автор", Справочники.Сотрудники.НайтиПоНаименованию("WebServices"));
//		ПараметрыЗаполнения.Вставить("Заголовок", Заголовок);
//		ПараметрыЗаполнения.Вставить("ОписаниеФорматированное", ФорматированныйДокумент);
//		
//		//ОписаниеЗадачи = СтрШаблон("Неисправность: %1:%2", СтрОтветственный.Неисправность,СтрОтветственный.ПричиныНеисправности);
//		//
//		//ПараметрыЗаполнения.Вставить("Описание", ОписаниеЗадачи);
//		//ПараметрыЗаполнения.Вставить("Приоритет", Справочники.ПриоритетыЗадач.Высокий);
//		
//		//ПараметрыЗаполнения.Вставить("Срок", 86400);
//		
//		ЗадачаОбъект.Заполнить(ПараметрыЗаполнения);
//		
//		ДанныеВидаЗадачи = РаботаСЗадачамиПовтИсп.ДанныеВидаЗадачи(ЗадачаОбъект.ВидЗадачи);
//		
//		ЗадачаОбъект.УстановитьУчастников(
//			МассивДляИсполнения,
//			ДанныеВидаЗадачи.ВидУчастникаИсполнитель);
//		
//		//ЗадачаОбъект.УстановитьУчастника(
//		//	мКому,
//		//	ДанныеВидаЗадачи.ВидУчастникаИсполнитель);
//		
//		ЗадачаОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		
//		ПараметрыНаправленияНаИсполнение = РаботаСЗадачамиКлиентСервер.НовыйПараметрыНаправленияНаИсполнение();
//		ПараметрыНаправленияНаИсполнение.Задача = ЗадачаОбъект.Ссылка;
//		
//		//ПараметрыНаправленияНаИсполнение.ЗапуститьВФоне = Истина;
//		//ПараметрыНаправленияНаИсполнение.ЭтоИнтерактивноеДействие = истина;
//		//ПараметрыНаправленияНаИсполнение.ИдентификаторФормы = Новый УникальныйИдентификатор());
//		//ПараметрыНаправленияНаИсполнение.Вставить("ЗапущенаДлительнаяОперация", Ложь);
//		//ПараметрыНаправленияНаИсполнение.Вставить("ДлительнаяОперация", Неопределено);
//		
//		РезультатНаправленияНаИсполнение = РаботаСЗадачами.НаправитьНаИсполнение(ПараметрыНаправленияНаИсполнение);
////	КонецЦикла;

КонецПроцедуры

Процедура СоздатьЗадачиПоОзнакомлениюНеисправности(Предмет, ФорматированныйДокумент)
	
	////Сообщение = ДанныеЧекЛиста.Сообщение;
	//
	//МассивДляОзнакомления = ПолучитьСписокДляОзнакомления();
	//
	//Заголовок = СтрШаблон("%1", "Задачи на ознакомление");
	//
	//сс="";
	////Для каждого СтрОтветственный Из ТЧ_Ответственный Цикл
	//	ЗадачаОбъект = Документы.Задача.СоздатьДокумент();
	//	
	//	ПараметрыЗаполнения = Новый Структура;
	//	ПараметрыЗаполнения.Вставить("ВидЗадачи", Справочники.ВидыЗадач.Ознакомление);
	//	ПараметрыЗаполнения.Вставить("Основание", Предмет);
	//	ПараметрыЗаполнения.Вставить("Автор", Справочники.Сотрудники.НайтиПоНаименованию("WebServices"));
	//	ПараметрыЗаполнения.Вставить("Заголовок", Заголовок);
	//	ПараметрыЗаполнения.Вставить("ОписаниеФорматированное", ФорматированныйДокумент);
	//	
	//	//ОписаниеЗадачи = "Неисправность: "+ОписаниеПроблем;
	//	//СтрШаблон("Неисправность: %1:%2", СтрОтветственный.Неисправность,СтрОтветственный.ПричиныНеисправности);
	//	
	//	//ПараметрыЗаполнения.Вставить("Описание", ОписаниеЗадачи);
	//	//ПараметрыЗаполнения.Вставить("Приоритет", Справочники.ПриоритетыЗадач.Высокий);
	//	
	//	//ПараметрыЗаполнения.Вставить("Срок", 86400);
	//	
	//	ЗадачаОбъект.Заполнить(ПараметрыЗаполнения);
	//	
	//	ДанныеВидаЗадачи = РаботаСЗадачамиПовтИсп.ДанныеВидаЗадачи(ЗадачаОбъект.ВидЗадачи);
	//	
	//	//ТЧ_Ознакомление
	//		ЗадачаОбъект.УстановитьУчастников(
	//			МассивДляОзнакомления,
	//			ДанныеВидаЗадачи.ВидУчастникаИсполнитель);
	//	
	//	//ЗадачаОбъект.УстановитьУчастника(
	//	//	мКому,
	//	//	ДанныеВидаЗадачи.ВидУчастникаИсполнитель);
	//	
	//	ЗадачаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	
	//	ПараметрыНаправленияНаИсполнение = РаботаСЗадачамиКлиентСервер.НовыйПараметрыНаправленияНаИсполнение();
	//	ПараметрыНаправленияНаИсполнение.Задача = ЗадачаОбъект.Ссылка;
	//	
	//	//ПараметрыНаправленияНаИсполнение.ЗапуститьВФоне = Истина;
	//	//ПараметрыНаправленияНаИсполнение.ЭтоИнтерактивноеДействие = истина;
	//	//ПараметрыНаправленияНаИсполнение.ИдентификаторФормы = Новый УникальныйИдентификатор());
	//	//ПараметрыНаправленияНаИсполнение.Вставить("ЗапущенаДлительнаяОперация", Ложь);
	//	//ПараметрыНаправленияНаИсполнение.Вставить("ДлительнаяОперация", Неопределено);
	//	
	//	РезультатНаправленияНаИсполнение = РаботаСЗадачами.НаправитьНаИсполнение(ПараметрыНаправленияНаИсполнение);
	//	
	////КонецЦикла;
	////КонецЕсли;

КонецПроцедуры

Функция ПолучитьСписокДляОзнакомления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ПользователиОзнакомленияЧекЛист.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.GDS_ПользователиОзнакомленияЧекЛист КАК GDS_ПользователиОзнакомленияЧекЛист
		|ГДЕ
		|	GDS_ПользователиОзнакомленияЧекЛист.ВидДействия = ЗНАЧЕНИЕ(Перечисление.GDS_ВидДействия.Ознакомление)";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");

КонецФункции

Функция ПолучитьСписокДляИсполнения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ПользователиОзнакомленияЧекЛист.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.GDS_ПользователиОзнакомленияЧекЛист КАК GDS_ПользователиОзнакомленияЧекЛист
		|ГДЕ
		|	GDS_ПользователиОзнакомленияЧекЛист.ВидДействия = ЗНАЧЕНИЕ(Перечисление.GDS_ВидДействия.Исполнение)";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");

КонецФункции

Функция ПолучитьНастройкуУведомлений()

	Запрос = Новый Запрос; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_НастройкаУведомлениеОПроблемахЧекЛистов.Неисправность.Наименование КАК Неисправность,
	|	GDS_НастройкаУведомлениеОПроблемахЧекЛистов.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрСведений.GDS_НастройкаУведомлениеОПроблемахЧекЛистов КАК GDS_НастройкаУведомлениеОПроблемахЧекЛистов"; 
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция РазборЧерезРегулярноеВыражение(СтрокаПоиска)
	
	НеисправностиТехники = Новый ТаблицаЗначений;
	НеисправностиТехники.Колонки.Добавить("Неисправность");
	НеисправностиТехники.Колонки.Добавить("ПричиныНеисправности");
	НеисправностиТехники.Колонки.Добавить("Ответственный");
	
	НеисправностиКомментарий = Новый ТаблицаЗначений;
	
	НеисправностиКомментарий.Колонки.Добавить("Наименование");
	НеисправностиКомментарий.Колонки.Добавить("Комментарий");
	
	СтрокаРегулярноеВыражение = """([^""]*?) \{радиокнопка\}""\s*:\s*""Неисправно""";;
	СтрокаРегулярноеВыражениеv2 = "([^""]*?) \{комментарий\}""\s*:\s*""([^""]*)";;
	
	МассивНеисправно = СтрНайтиВсеПоРегулярномуВыражению(СтрокаПоиска, СтрокаРегулярноеВыражение,,Истина);
	Для Каждого СтрМ Из МассивНеисправно Цикл
		ГруппаМ = СтрМ.ПолучитьГруппы();
		
		НоваяСтрока = НеисправностиТехники.Добавить();
		НоваяСтрока.Неисправность = ГруппаМ[0].Значение;
	КонецЦикла;
	
	МассивКомментарий = СтрНайтиВсеПоРегулярномуВыражению(СтрокаПоиска, СтрокаРегулярноеВыражениеv2,,Истина);
	Для Каждого СтрМ Из МассивКомментарий Цикл
		ГруппаМ = СтрМ.ПолучитьГруппы();
		
		НоваяСтрока = НеисправностиКомментарий.Добавить();
		НоваяСтрока.Наименование = ГруппаМ[0].Значение;
		НоваяСтрока.Комментарий  = ГруппаМ[1].Значение
	КонецЦикла;
	
	Для Каждого СтрНеисправности Из НеисправностиТехники Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Наименование",СтрНеисправности.Неисправность);
		
		МассивСтрок = НеисправностиКомментарий.НайтиСтроки(Отбор);
		Если МассивСтрок.Количество() = 1 Тогда
			ИндексСтроки = НеисправностиТехники.Индекс(СтрНеисправности);
			СтрокаТЧ = НеисправностиТехники.Получить(ИндексСтроки);
			
			СтрокаТЧ.ПричиныНеисправности = МассивСтрок[0].Комментарий;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НеисправностиТехники;
	
//ТЧ_Параметры = Новый ТаблицаЗначений;
	//ТЧ_Параметры.Колонки.Добавить("НаименованиеПроблемы");
	//ТЧ_Параметры.Колонки.Добавить("Значение");
	//ТЧ_Параметры.Колонки.Добавить("Комментарий");
	
КонецФункции

Функция СоздатьДокументПредприятия(ДанныеЧекЛиста, ОписаниеПроблем)
	
	ВнДок					= Справочники.ДокументыПредприятия.СоздатьЭлемент();
	
	//ШаблонДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ШаблонДокумента", Справочники.ШаблоныДокументов.ПустаяСсылка());
	
	ВнДок.Шаблон			= Справочники.ШаблоныДокументов.НайтиПоНаименованию("Чек лист ТС");
	ВнДок.ВидДокумента		= Справочники.ВидыДокументов.НайтиПоНаименованию("Чек лист ТС");
//	ВнДок.Тематика			= Тематика;

    МассивОписание = СтрРазделить(ДанныеЧекЛиста.Описание,"/");
	
	ДанныеТС = ДанныеЧекЛиста.ДанныеТС.Получить();
	
	СтруктураТС = ДанныеТС.Получить("СтруктураТС");
	
	ДатаСервиса	= СтруктураТС.ДатаСервиса;
	ПУ			= СтруктураТС.ПУ;
	Флот		= СтруктураТС.Флот;
	ГосНомер	= СтруктураТС.ГосНомер;
	
	ШаблонСодержания = СтрШаблон("Авто: %1 Пользователь: %2", СтруктураТС.Авто+Символы.ПС, СтруктураТС.Ответственный);

	
	Содержание = ШаблонСодержания
	+Символы.ПС
	+Символы.ПС
	+ОписаниеПроблем;
	
	Наименование  = МассивОписание[1];
	//Ответственный = "";
	Подготовил    = Справочники.Сотрудники.НайтиПоНаименованию("WebServices");
	Подразделение = Справочники.СтруктураПредприятия.НайтиПоКоду("00-000899");//...Системное подразделение
	Организация   = Справочники.Организации.НайтиПоРеквизиту("ИНН",ДанныеЧекЛиста.ИНН);
	
	ТекущийПользователь = Подготовил;
	
	ВнДок.Заголовок			= Наименование;  
	ВнДок.Наименование 		= Наименование;
	
	Если ЗначениеЗаполнено(Содержание) Тогда
		ВнДок.Содержание = Содержание;
	КонецЕсли; 
	
	//ВнДок.Ответственный			= Ответственный;
	ВнДок.Подготовил			= Подготовил;
	ВнДок.Подразделение			= Подразделение;
	
	ВнДок.ДатаСоздания			= ТекущаяДатаСеанса();
	//ВнДок.Комментарий			= Комментарий;
	
	ВнДок.Организация			= Организация;
	
	ВнДок.РегистрационныйНомер	= "";
	ВнДок.ЧисловойНомер			= 0;
	ВнДок.ДатаРегистрации		= '00010101';
	
	ВнДок.Создал				= Подготовил;
	
	ВнДок.Зарегистрировал		= Справочники.Сотрудники.ПустаяСсылка();		
	ВнДок.КоличествоЭкземпляров	= 1;
	ВнДок.КоличествоЛистов		= 1;
	ВнДок.КоличествоПриложений	= 0;
	ВнДок.ЛистовВПриложениях	= 0;
	ВнДок.Дело					= Справочники.ДелаХраненияДокументов.ПустаяСсылка();
	ВнДок.СрокИсполнения		= '00010101';
	
	//ВнДок.Проект			= РаботаСПроектами.ПолучитьПроектПоУмолчанию();
	ВнДок.ФормаДокумента	= Перечисления.ВариантыФормДокументов.Электронная;
	ВнДок.Записать();
	
	//Получить дополнительные реквизиты
	ДопРеквизиты = УправлениеСвойствами.СвойстваОбъекта(ВнДок.Ссылка, Истина);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТЗ.Колонки.Добавить("Значение");
	
	Если ДопРеквизиты.Количество() > 0 Тогда
		Для Каждого СтрДоп Из ДопРеквизиты Цикл			
			Если СтрДоп.Наименование = "Дата" Тогда	
				НовСтр = ТЗ.Добавить();
				НовСтр.Свойство = СтрДоп;
				НовСтр.Значение = ДатаСервиса;	
			ИначеЕсли СтрДоп.Наименование = "ПУ" Тогда	
				НовСтр = ТЗ.Добавить();
				НовСтр.Свойство = СтрДоп;
				НовСтр.Значение = ПУ;
			ИначеЕсли СтрДоп.Наименование = "Флот" Тогда	
				НовСтр = ТЗ.Добавить();
				НовСтр.Свойство = СтрДоп;
				НовСтр.Значение = Флот;
			ИначеЕсли СтрДоп.Наименование = "ГосНомер" Тогда	
				НовСтр = ТЗ.Добавить();
				НовСтр.Свойство = СтрДоп;
				НовСтр.Значение = ГосНомер;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ВнДок.Ссылка,ТЗ);
	
	//Состояние документа проект
	//Делопроизводство.ЗаписатьСостояниеДокумента(ВнДок.Ссылка, ТекущаяДатаСеанса(), Перечисления.СостоянияДокументов.Проект, ТекущийПользователь);
	
	Возврат ВнДок.Ссылка;
КонецФункции

Функция ПодготовитьДанныеОПроблемах(Идентификатор)

	МассивИтог = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_СведенияОЧекЛисте.Пункт КАК Пункт,
		|	GDS_СведенияОЧекЛисте.ВидМодели КАК ВидМодели,
		|	GDS_СведенияОЧекЛисте.СостояниеПроверки КАК СостояниеПроверки,
		|	GDS_СведенияОЧекЛисте.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.GDS_СведенияОЧекЛисте КАК GDS_СведенияОЧекЛисте
		|ГДЕ
		|	GDS_СведенияОЧекЛисте.Идентификатор = &Идентификатор
		|	И (GDS_СведенияОЧекЛисте.СостояниеПроверки = ЗНАЧЕНИЕ(Перечисление.GDS_СостояниеПроверки.Неисправно)
		|			ИЛИ GDS_СведенияОЧекЛисте.СостояниеПроверки = ЗНАЧЕНИЕ(Перечисление.GDS_СостояниеПроверки.Отсутствует)
		|			ИЛИ GDS_СведенияОЧекЛисте.Комментарий <> """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидМодели
		|ИТОГИ ПО
		|	ВидМодели
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидМодели = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидМодели.Следующий() Цикл
		ИтоговыйФормат = "";
		
		НаименованиеПроблемы = Строка(ВыборкаВидМодели.ВидМодели);
		
		ВыборкаДетальныеЗаписи = ВыборкаВидМодели.Выбрать();

		МассивПроблем = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ШаблонПроблем = СтрШаблон("%1:%2 - %3",ВыборкаДетальныеЗаписи.Пункт, ВыборкаДетальныеЗаписи.СостояниеПроверки, ВыборкаДетальныеЗаписи.Комментарий);
			
			МассивПроблем.Добавить(ШаблонПроблем);
		КонецЦикла;
		
		ОписаниеПроблем = СтрСоединить(МассивПроблем, Символы.ПС);
		
		ИтоговыйФормат = СтрШаблон("%1: %2", НаименованиеПроблемы,Символы.ПС+ОписаниеПроблем);
		
		МассивИтог.Добавить(ИтоговыйФормат);
		
	КонецЦикла;
	
	СтрокаИтог = СтрСоединить(МассивИтог, Символы.ПС+Символы.ПС);
	
	Возврат СтрокаИтог;
	//МассивПроблем = ОбщегоНазначения.ТаблицаЗначенийВМассив();
	
КонецФункции

Функция ПолучитьДанныеДляОбработки()
	
	Запрос = Новый Запрос; 
	
	Запрос.УстановитьПараметр("ДатаАнализа", КонецДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Статус", Перечисления.ЛК_СтатусСообщения.Ожидает);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.ИНН КАК ИНН,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.ИсточникСообщения КАК ИсточникСообщения,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.Описание КАК Описание,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.Статус КАК Статус,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.Сообщение КАК Сообщение,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения КАК УИНСообщения,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.ДанныеТС КАК ДанныеТС,
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.ДопДанные КАК ДопДанные
	|ИЗ
	|	РегистрСведений.GDS_ОчередьСообщенийЧекЛист.СрезПоследних(&ДатаАнализа, ) КАК GDS_ОчередьСообщенийЧекЛистСрезПоследних
	|ГДЕ
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.Статус = &Статус"; 
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДобавитьФайлДляПрсоединения(СписокФайлов, ПолноеИмя, НазваниеФайла, Адрес, РольФайла)
	ПараметрыДобавления = Новый Структура;
	
	Если РольФайла = Справочники.РолиФайлов.НайтиПоНаименованию("Дополнительные") Тогда
		Если СтрНайти(НазваниеФайла, "вложение")>0 Тогда
		Иначе
			НазваниеФайла = "Фото сотрудника";
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыДобавления.Вставить("НазваниеФайла", НазваниеФайла);
	ПараметрыДобавления.Вставить("Расширение", ПолучитьРасширениеИмениФайла(ПолноеИмя));
	ПараметрыДобавления.Вставить("Размер", );
	ПараметрыДобавления.Вставить("АдресХранилищаФайла", Адрес);
	ПараметрыДобавления.Вставить("РольФайла", РольФайла);
	
	СписокФайлов.Добавить(ПараметрыДобавления);
КонецПроцедуры

Функция ПолучитьРасширениеИмениФайла(Знач ИмяФайла) Экспорт
	
	РасширениеФайла = "";
	МассивСтрок = СтрРазделить(ИмяФайла, ".", Ложь);
	Если МассивСтрок.Количество() > 1 Тогда
		РасширениеФайла = МассивСтрок[МассивСтрок.Количество() - 1];
	КонецЕсли;
	Возврат РасширениеФайла;
	
КонецФункции

Функция ПрикрепитьФайл(
	ВладелецФайла,
	АдресВременногоХранилищаФайла,
	ИмяСоздаваемогоФайла,
	Расширение,
	Размер,
	РольФайла)
	
	// Создадим карточку Файла в БД
	СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
	СведенияОФайле.ИмяБезРасширения = ИмяСоздаваемогоФайла;
	СведенияОФайле.РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Расширение);
	СведенияОФайле.Размер = Размер;
	СведенияОФайле.АдресВременногоХранилищаФайла = АдресВременногоХранилищаФайла;
	СведенияОФайле.АдресВременногоХранилищаТекста = "";
	СведенияОФайле.ХранитьВерсии = Истина;
	СведенияОФайле.ЗаписатьВИсторию = Истина;
	СведенияОФайле.НеобходимоВыполнитьВставкуШКНаКлиенте = Ложь;
	СведенияОФайле.ВремяИзменения = ТекущаяДатаСеанса();
	СведенияОФайле.ВремяИзмененияУниверсальное = ТекущаяДатаСеанса();
	СведенияОФайле.РольФайла = РольФайла;
	
	Док = "";//РаботаСФайламиВызовСервера.СоздатьФайлСВерсией(ВладелецФайла, СведенияОФайле);
	
	Возврат Док;
	
КонецФункции

Процедура ЗаписатьСведенияОЧекЛисте(Сообщение) Экспорт

	сс= "";
	
	
КонецПроцедуры

Процедура ЗаписатьДокументЧекЛиста(Предмет, ДанныеЧекЛиста) Экспорт
	
	НоваяЗапись = РегистрыСведений.GDS_ДокументыЧекЛиста.СоздатьМенеджерЗаписи();
	НоваяЗапись.Документ = Предмет;
	НоваяЗапись.УИН = ДанныеЧекЛиста.УИНСообщения;
	
	НоваяЗапись.Записать();

КонецПроцедуры

функция ПодготовитьПечатнуюФормуЧекЛиста(Идентификатор)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб 		 = Истина;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Карточка_Чек_Листа_МеКаМи";
	
	Макет = Справочники.ДокументыПредприятия.ПолучитьМакет("GDS_КарточкаЧекЛиста");	
	
	ОбластьЗаголовок			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТС				= Макет.ПолучитьОбласть("ШапкаТС");
	ОбластьШапкаПрицеп			= Макет.ПолучитьОбласть("ШапкаПрицеп");
	ОбластьШапкаНеисправность	= Макет.ПолучитьОбласть("ШапкаНеисправность");
	ОбластьСтрокаНеисправность	= Макет.ПолучитьОбласть("СтрокаНеисправность");
	ОбластьПодвалТС				= Макет.ПолучитьОбласть("ПодвалТС");
	ОбластьПодвалПрицеп			= Макет.ПолучитьОбласть("ПодвалПрицеп");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	GDS_СведенияОТехнике.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_Идентифитор
	|ИЗ
	|	РегистрСведений.GDS_СведенияОТехнике КАК GDS_СведенияОТехнике
	|ГДЕ
	|	GDS_СведенияОТехнике.Идентификатор = &Идентификатор
	|
	|СГРУППИРОВАТЬ ПО
	|	GDS_СведенияОТехнике.Идентификатор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	GDS_СведенияОТехнике.Идентификатор КАК Идентификатор,
	|	GDS_СведенияОТехнике.ГосНомер КАК ГосНомер,
	|	GDS_СведенияОТехнике.Авто КАК Авто,
	|	GDS_СведенияОТехнике.ВидМодели КАК ВидМодели,
	|	GDS_СведенияОТехнике.МотоЧасыТО КАК МотоЧасыТО,
	|	GDS_СведенияОТехнике.МотоЧасыФакт КАК МотоЧасыФакт,
	|	GDS_СведенияОТехнике.Пробег КАК Пробег,
	|	GDS_СведенияОТехнике.ОстатокТоплива КАК ОстатокТоплива,
	|	GDS_СведенияОТехнике.ПУ КАК ПУ,
	|	GDS_СведенияОТехнике.Флот КАК Флот,
	|	GDS_СведенияОТехнике.Ответственный КАК Ответственный,
	|	GDS_СведенияОТехнике.НомерПлатона КАК НомерПлатона,
	|	GDS_СведенияОТехнике.Дата КАК Дата,
	|	GDS_СведенияОТехнике.ДатаСервиса КАК ДатаСервиса,
	|	GDS_СведенияОТехнике.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТ_Техника
	|ИЗ
	|	ВТ_Идентифитор КАК ВТ_Идентифитор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СведенияОТехнике КАК GDS_СведенияОТехнике
	|		ПО ВТ_Идентифитор.Идентификатор = GDS_СведенияОТехнике.Идентификатор
	|ГДЕ
	|	GDS_СведенияОТехнике.ВидМодели = ЗНАЧЕНИЕ(Перечисление.GDS_ВидМоделиТС.Автотранспорт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	GDS_СведенияОТехнике.Идентификатор,
	|	GDS_СведенияОТехнике.ГосНомер,
	|	GDS_СведенияОТехнике.Авто,
	|	GDS_СведенияОТехнике.ВидМодели,
	|	GDS_СведенияОТехнике.МотоЧасыТО,
	|	GDS_СведенияОТехнике.МотоЧасыФакт,
	|	GDS_СведенияОТехнике.Пробег,
	|	GDS_СведенияОТехнике.ОстатокТоплива,
	|	GDS_СведенияОТехнике.ПУ,
	|	GDS_СведенияОТехнике.Флот,
	|	GDS_СведенияОТехнике.Ответственный,
	|	GDS_СведенияОТехнике.НомерПлатона,
	|	GDS_СведенияОТехнике.Дата,
	|	GDS_СведенияОТехнике.ДатаСервиса,
	|	GDS_СведенияОТехнике.Комментарий
	|ИЗ
	|	ВТ_Идентифитор КАК ВТ_Идентифитор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СведенияОТехнике КАК GDS_СведенияОТехнике
	|		ПО ВТ_Идентифитор.Идентификатор = GDS_СведенияОТехнике.Идентификатор
	|ГДЕ
	|	GDS_СведенияОТехнике.ВидМодели = ЗНАЧЕНИЕ(Перечисление.GDS_ВидМоделиТС.Прицеп)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения КАК УИНСообщения,
	|	GDS_ПунктыПроверкиТС.Ссылка КАК Ссылка,
	|	GDS_ПунктыПроверкиТС.ВидМодели КАК ВидМодели
	|ПОМЕСТИТЬ ВТ_ПунктыПроверки
	|ИЗ
	|	ВТ_Идентифитор КАК ВТ_Идентифитор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_ОчередьСообщенийЧекЛист.СрезПоследних(&ДатаАнализа, ) КАК GDS_ОчередьСообщенийЧекЛистСрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.GDS_ПунктыПроверкиТС КАК GDS_ПунктыПроверкиТС
	|			ПО (ИСТИНА)
	|		ПО ВТ_Идентифитор.Идентификатор = GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения
	|ГДЕ
	|	НЕ GDS_ПунктыПроверкиТС.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПунктыПроверки.УИНСообщения КАК УИНСообщения,
	|	ВТ_ПунктыПроверки.Ссылка КАК Ссылка,
	|	ВТ_ПунктыПроверки.ВидМодели КАК ВидМодели,
	|	GDS_СведенияОЧекЛисте.СостояниеПроверки КАК СостояниеПроверки,
	|	GDS_СведенияОЧекЛисте.Комментарий КАК Комментарий,
	|	ВЫБОР
	|		КОГДА GDS_СведенияОЧекЛисте.Вложение = ЗНАЧЕНИЕ(Перечисление.GDS_ПризнакВложения.Присутствует)
	|			ТОГДА ""Да""
	|		ИНАЧЕ ""Нет""
	|	КОНЕЦ КАК Вложение
	|ПОМЕСТИТЬ ВТ_СведенияПроверки
	|ИЗ
	|	ВТ_ПунктыПроверки КАК ВТ_ПунктыПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СведенияОЧекЛисте КАК GDS_СведенияОЧекЛисте
	|		ПО (GDS_СведенияОЧекЛисте.Пункт = ВТ_ПунктыПроверки.Ссылка)
	|			И (GDS_СведенияОЧекЛисте.Идентификатор = ВТ_ПунктыПроверки.УИНСообщения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Техника.Идентификатор КАК Идентификатор,
	|	ВТ_Техника.ГосНомер КАК ГосНомер,
	|	ВТ_Техника.Авто КАК Авто,
	|	ВТ_Техника.ВидМодели КАК ВидМодели,
	|	ВТ_Техника.МотоЧасыТО КАК МотоЧасыТО,
	|	ВТ_Техника.МотоЧасыФакт КАК МотоЧасыФакт,
	|	ВТ_Техника.Пробег КАК Пробег,
	|	ВТ_Техника.ОстатокТоплива КАК ОстатокТоплива,
	|	ВТ_Техника.ПУ КАК ПУ,
	|	ВТ_Техника.Флот КАК Флот,
	|	ВТ_Техника.Ответственный КАК Ответственный,
	|	ВТ_Техника.НомерПлатона КАК НомерПлатона,
	|	ВТ_Техника.Дата КАК Дата,
	|	ВТ_Техника.ДатаСервиса КАК ДатаСервиса,
	|	ВТ_Техника.Комментарий КАК Комментарий
	|ИЗ
	|	ВТ_Техника КАК ВТ_Техника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СведенияПроверки.УИНСообщения КАК УИНСообщения,
	|	ВТ_СведенияПроверки.Ссылка КАК Пункт,
	|	ВТ_СведенияПроверки.ВидМодели КАК ВидМодели,
	|	ВТ_СведенияПроверки.СостояниеПроверки КАК СостояниеПроверки,
	|	ВТ_СведенияПроверки.Комментарий КАК Комментарий,
	|	ВТ_СведенияПроверки.Вложение КАК Вложение
	|ИЗ
	|	ВТ_СведенияПроверки КАК ВТ_СведенияПроверки";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ДатаАнализа", КонецДня(ТекущаяДата()));
	
	Результат = Запрос.ВыполнитьПакет(); 
	КоличествоЗапросов = Результат.Количество();

	ПервыйДокумент = Истина;
	
	ВыборкаТС = Результат[КоличествоЗапросов - 2].Выбрать();
	
	ТЗ_СведенияТехники = Результат[КоличествоЗапросов - 1].Выгрузить();
	
	Пока ВыборкаТС.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки с которой начали выводить текущий документ
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ВыборкаТС.ВидМодели = Перечисления.GDS_ВидМоделиТС.Автотранспорт Тогда
			
			ОбластьЗаголовок.Параметры.ID = ВыборкаТС.Идентификатор;
			
			ОбластьЗаголовок.Параметры.Дата				= ВыборкаТС.Дата;
			ОбластьЗаголовок.Параметры.ПУ				= ВыборкаТС.ПУ;
			ОбластьЗаголовок.Параметры.Флот				= ВыборкаТС.Флот;
			ОбластьЗаголовок.Параметры.Ответственный	= ВыборкаТС.Ответственный;
			
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
			ОбластьШапкаТС.Параметры.Авто				= ВыборкаТС.Авто;
			ОбластьШапкаТС.Параметры.ГосНомер			= ВыборкаТС.ГосНомер;
			ОбластьШапкаТС.Параметры.МотоЧасыТО			= ВыборкаТС.МотоЧасыТО;
			ОбластьШапкаТС.Параметры.МотоЧасыФакт		= ВыборкаТС.МотоЧасыФакт;
			ОбластьШапкаТС.Параметры.Пробег				= ВыборкаТС.Пробег;
			ОбластьШапкаТС.Параметры.ОстатокТоплива		= ВыборкаТС.ОстатокТоплива;
			
			Если ЗначениеЗаполнено(ВыборкаТС.НомерПлатона) Тогда
				ШаблонПлатон = СтрШаблон("Платон №: %1",ВыборкаТС.НомерПлатона);
				ОбластьШапкаТС.Параметры.Номер_Платона		= ШаблонПлатон;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьШапкаТС);
			ТабличныйДокумент.Вывести(ОбластьШапкаНеисправность);
			
			Отбор = Новый Структура("ВидМодели", ВыборкаТС.ВидМодели);
			МассивСтрок = ТЗ_СведенияТехники.НайтиСтроки(Отбор);
			
			Для Каждого Стр Из МассивСтрок Цикл
				ОбластьСтрокаНеисправность.Параметры.Пункт = Стр.Пункт;
				ОбластьСтрокаНеисправность.Параметры.Состояние = Стр.СостояниеПроверки;
				ОбластьСтрокаНеисправность.Параметры.Комментарий = Стр.Комментарий;
				ОбластьСтрокаНеисправность.Параметры.Вложение = Стр.Вложение;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаНеисправность);
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ВыборкаТС.Комментарий) Тогда
				КомментарийШаблон = СтрШаблон("Комментарий: %1", ВыборкаТС.Комментарий);
				
				ОбластьПодвалТС.Параметры.Комментарий = КомментарийШаблон;
				ТабличныйДокумент.Вывести(ОбластьПодвалТС);
			КонецЕсли;
			
		ИначеЕсли ВыборкаТС.ВидМодели = Перечисления.GDS_ВидМоделиТС.Прицеп Тогда
			
			//ОбластьШапкаПрицеп.Параметры.Авто				= ВыборкаТС.Авто;
			ОбластьШапкаПрицеп.Параметры.ГосНомер			= ВыборкаТС.ГосНомер;
			ОбластьШапкаПрицеп.Параметры.МотоЧасыТО			= ВыборкаТС.МотоЧасыТО;
			ОбластьШапкаПрицеп.Параметры.МотоЧасыФакт		= ВыборкаТС.МотоЧасыФакт;
			ОбластьШапкаПрицеп.Параметры.Пробег				= ВыборкаТС.Пробег;
			ОбластьШапкаПрицеп.Параметры.ОстатокТоплива		= ВыборкаТС.ОстатокТоплива;
			
			ТабличныйДокумент.Вывести(ОбластьШапкаПрицеп);
			
			ТабличныйДокумент.Вывести(ОбластьШапкаНеисправность);
			
			Отбор = Новый Структура("ВидМодели", ВыборкаТС.ВидМодели);
			МассивСтрок = ТЗ_СведенияТехники.НайтиСтроки(Отбор);
			
			Для Каждого Стр Из МассивСтрок Цикл
				ОбластьСтрокаНеисправность.Параметры.Пункт = Стр.Пункт;
				ОбластьСтрокаНеисправность.Параметры.Состояние = Стр.СостояниеПроверки;
				ОбластьСтрокаНеисправность.Параметры.Комментарий = Стр.Комментарий;
				ОбластьСтрокаНеисправность.Параметры.Вложение = Стр.Вложение;
				
				ТабличныйДокумент.Вывести(ОбластьСтрокаНеисправность);
			КонецЦикла;
			
			Если ЗначениеЗаполнено(ВыборкаТС.Комментарий) Тогда
				КомментарийШаблон = СтрШаблон("Комментарий: %1", ВыборкаТС.Комментарий);
				
				ОбластьПодвалПрицеп.Параметры.Комментарий = КомментарийШаблон;
				ТабличныйДокумент.Вывести(ОбластьПодвалПрицеп);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВернутьСведенияТехника(Идентификатор, ВидМодели)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения КАК УИНСообщения,
		|	GDS_ПунктыПроверкиТС.Ссылка КАК Ссылка,
		|	GDS_ПунктыПроверкиТС.ВидМодели КАК ВидМодели
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.GDS_ОчередьСообщенийЧекЛист.СрезПоследних(&ДатаАнализа, ) КАК GDS_ОчередьСообщенийЧекЛистСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.GDS_ПунктыПроверкиТС КАК GDS_ПунктыПроверкиТС
		|		ПО (ИСТИНА)
		|ГДЕ
		|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения = &Идентификатор
		|	И GDS_ПунктыПроверкиТС.ВидМодели = &ВидМодели
		|	И НЕ GDS_ПунктыПроверкиТС.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.УИНСообщения КАК УИНСообщения,
		|	ВременнаяТаблица.Ссылка КАК Пункт,
		|	ВременнаяТаблица.ВидМодели КАК ВидМодели,
		|	GDS_СведенияОЧекЛисте.СостояниеПроверки КАК СостояниеПроверки,
		|	GDS_СведенияОЧекЛисте.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА GDS_СведенияОЧекЛисте.Вложение = ЗНАЧЕНИЕ(Перечисление.GDS_ПризнакВложения.Присутствует)
		|			ТОГДА ""Да""
		|		ИНАЧЕ ""Нет""
		|	КОНЕЦ КАК Вложение
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СведенияОЧекЛисте КАК GDS_СведенияОЧекЛисте
		|		ПО (GDS_СведенияОЧекЛисте.Пункт = ВременнаяТаблица.Ссылка)
		|			И (GDS_СведенияОЧекЛисте.Идентификатор = ВременнаяТаблица.УИНСообщения)";
	
	Запрос.УстановитьПараметр("ДатаАнализа", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВидМодели", ВидМодели);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ВернутьСведенияПрицеп(Идентификатор, ВидМодели)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения КАК УИНСообщения,
		|	GDS_ПунктыПроверкиТС.Ссылка КАК Ссылка,
		|	GDS_ПунктыПроверкиТС.ВидМодели КАК ВидМодели
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.GDS_ОчередьСообщенийЧекЛист.СрезПоследних(&ДатаАнализа, ) КАК GDS_ОчередьСообщенийЧекЛистСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.GDS_ПунктыПроверкиТС КАК GDS_ПунктыПроверкиТС
		|		ПО (ИСТИНА)
		|ГДЕ
		|	GDS_ОчередьСообщенийЧекЛистСрезПоследних.УИНСообщения = &Идентификатор
		|	И GDS_ПунктыПроверкиТС.ВидМодели = &ВидМодели
		|	И НЕ GDS_ПунктыПроверкиТС.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.УИНСообщения КАК УИНСообщения,
		|	ВременнаяТаблица.Ссылка КАК Пункт,
		|	ВременнаяТаблица.ВидМодели КАК ВидМодели,
		|	GDS_СведенияОЧекЛисте.СостояниеПроверки КАК СостояниеПроверки,
		|	GDS_СведенияОЧекЛисте.Комментарий КАК Комментарий,
		|	ВЫБОР
		|		КОГДА GDS_СведенияОЧекЛисте.Вложение = ЗНАЧЕНИЕ(Перечисление.GDS_ПризнакВложения.Присутствует)
		|			ТОГДА ""Да""
		|		ИНАЧЕ ""Нет""
		|	КОНЕЦ КАК Вложение
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.GDS_СведенияОЧекЛисте КАК GDS_СведенияОЧекЛисте
		|		ПО (GDS_СведенияОЧекЛисте.Пункт = ВременнаяТаблица.Ссылка)
		|			И (GDS_СведенияОЧекЛисте.Идентификатор = ВременнаяТаблица.УИНСообщения)";
	
	Запрос.УстановитьПараметр("ДатаАнализа", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВидМодели", ВидМодели);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
